#начало комментариев
echo -e "\e[34mИдет инициализация всех необходимых компонентов.\e[0m"
#обновление пакетов
echo "Проводиться проверка новых пакетов системы..."
sudo apt-get upgrade
#установка питона
echo "Установка Python"
sudo apt install python3-dev
sudo apt install python3-pip
#модули для питона (с Pillow всегда какая та ёбля)
echo "Установка модулей для Python."
pip3 install simplejson
pip3 install untangle
pip3 install requests
pip3 install psutil
pip3 install pillow #бывает не ставится
pip3 install captcha_solver
#фиксы (чинит ёблю с Pillow и с psutil если тоже траблы)
echo "Установка дополнительных модулей"
sudo apt install python3-pil
sudo apt install python-psutil
#цветная надпись
echo -e "\e[34mВсе необходимые модули были установлены! Пробуйте запустить бота\e[0m"
#создатель скрипта (я не ебу зачем это пишу)
echo -e "\e[1;36mАвтор скрипта Leshidzo\e[0m"
#принт
echo ".##.....##....###.....######..####.##.......####..######.....###... " 
echo ".##.....##...##.##...##....##..##..##........##..##....##...##.##.."
echo ".##.....##..##...##..##........##..##........##..##........##...##. "
echo ".##.....##.##.....##..######...##..##........##...######..##.....## "
echo "..##...##..#########.......##..##..##........##........##.######### "
echo "...##.##...##.....##.##....##..##..##........##..##....##.##.....##"
echo "....###....##.....##..######..####.########.####..######..##.....##"
#выход (я не ебу зачем я его сюда написал)
exit
